Revit 2027 API
BuiltInFailures.StairRampFailures.StairsBottomEndExceedsOrNotReachWarning Property
 Stair bottom end exceeds or cannot reach the base elevation of the stair. Add/remove risers at the bottom end or change base elevation settings in Stair Properties.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairsBottomEndExceedsOrNotReachWarning { get; }
Public Shared ReadOnly Property StairsBottomEndExceedsOrNotReachWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairsBottomEndExceedsOrNotReachWarning {
	FailureDefinitionId^ get ();
}
static member StairsBottomEndExceedsOrNotReachWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace